#Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.

def primeNumbers(num):
   i = 2 # начнем итерацию с первого простого числа больше 1
   primeNum = []
   while i * i <= num: # условие, при котором имеет смысл искать бОльшие простые множители, если 2*2>n,то 2*3 тем более
       while num % i == 0:
           primeNum.append(i) # запишется простое число,так как начинаем перебирать множители минимального - с двойки. Ровно столько раз,сколько можно поделить на него исходное число без остатка
           num = num/ i 
       i = i + 1
   if num > 1:
      primeNum.append(num) #записываем оставшееся простое число, если оно не 1, как в случае, на пример  с 4 или 9, которые делятся на последнем i подряд до 1 во вложенном цикле
   return primeNum
print(primeNumbers(9))